#### Connection to DB

In [27]:
%load_ext sql

In [28]:
%sql postgresql+psycopg2://postgres:superPassWork22@localhost:5555/SQLPuzzles

### RESOURCES

In [ ]:
!pip install ipython-sql

Functions DOCS <br>
https://cloud.google.com/spanner/docs/reference/postgresql/functions-and-operators

### Puzzle #1

In [8]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Cart1;
DROP TABLE IF EXISTS Cart2;

CREATE TABLE Cart1
(
Item  VARCHAR(100) PRIMARY KEY
);

CREATE TABLE Cart2
(
Item  VARCHAR(100) PRIMARY KEY
);

INSERT INTO Cart1 (Item) VALUES
('Sugar'),('Bread'),('Juice'),('Soda'),('Flour');

INSERT INTO Cart2 (Item) VALUES
('Sugar'),('Bread'),('Butter'),('Cheese'),('Fruit');

[]

In [9]:
%%capture --no-display
%%sql

SELECT *
FROM Cart1
FULL OUTER JOIN Cart2 ON Cart1.item = Cart2.item

[('Sugar', 'Sugar'),
 ('Bread', 'Bread'),
 ('Juice', None),
 ('Soda', None),
 ('Flour', None),
 (None, 'Fruit'),
 (None, 'Butter'),
 (None, 'Cheese')]

### Puzzle #2

In [10]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees
(
EmployeeID  INTEGER PRIMARY KEY,
ManagerID   INTEGER NULL,
JobTitle    VARCHAR(100) NOT NULL
);

INSERT INTO Employees (EmployeeID, ManagerID, JobTitle) VALUES
(1001,NULL,'President'),(2002,1001,'Director'),
(3003,1001,'Office Manager'),(4004,2002,'Engineer'),
(5005,2002,'Engineer'),(6006,2002,'Engineer');

[]

### Puzzle 3

In [ ]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS EmployeePayRecords;

CREATE TABLE EmployeePayRecords
(
EmployeeID  INTEGER,
FiscalYear  INTEGER,
StartDate   DATE,
EndDate     DATE,
PayRate     MONEY
);

### Puzzle #4

In [11]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Orders;

CREATE TABLE Orders
(
CustomerID     INTEGER,
OrderID        INTEGER,
DeliveryState  VARCHAR(100) NOT NULL,
Amount         MONEY NOT NULL,
PRIMARY KEY (CustomerID, OrderID)
);

INSERT INTO Orders (CustomerID, OrderID, DeliveryState, Amount) VALUES
(1001,1,'CA',340),(1001,2,'TX',950),(1001,3,'TX',670),
(1001,4,'TX',860),(2002,5,'WA',320),(3003,6,'CA',650),
(3003,7,'CA',830),(4004,8,'TX',120);

[]

In [18]:
%%capture --no-display
%%sql

SELECT *
FROM Orders
WHERE DeliveryState = 'TX'
LIMIT (
SELECT COUNT(customerid)
FROM Orders
WHERE DeliveryState = 'CA'
);

[(1001, 2, 'TX', '$950.00'),
 (1001, 3, 'TX', '$670.00'),
 (1001, 4, 'TX', '$860.00')]

### Puzzle #5

In [20]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS PhoneDirectory;

CREATE TABLE PhoneDirectory
(
CustomerID  INTEGER,
[Type]      VARCHAR(100),
PhoneNumber VARCHAR(12) NOT NULL,
PRIMARY KEY (CustomerID, [Type])
);

INSERT INTO PhoneDirectory (CustomerID, [Type], PhoneNumber) VALUES
(1001,'Cellular','555-897-5421'),
(1001,'Work','555-897-6542'),
(1001,'Home','555-698-9874'),
(2002,'Cellular','555-963-6544'),
(2002,'Work','555-812-9856'),
(3003,'Cellular','555-987-6541');

### Puzzle #6

In [4]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS WorkflowSteps;

CREATE TABLE WorkflowSteps
(
Workflow        VARCHAR(100),
StepNumber      INTEGER,
CompletionDate  DATE NULL,
PRIMARY KEY (Workflow, StepNumber)
);

INSERT INTO WorkflowSteps (Workflow, StepNumber, CompletionDate) VALUES
('Alpha',1,'7/2/2018'),('Alpha',2,'7/2/2018'),('Alpha',3,'7/1/2018'),
('Bravo',1,'6/25/2018'),('Bravo',2,NULL),('Bravo',3,'6/27/2018'),
('Charlie',1,NULL),('Charlie',2,'7/1/2018');

[]

In [7]:
%%capture --no-display
%%sql

SELECT *
FROM WorkflowSteps

[('Alpha', 1, datetime.date(2018, 7, 2)),
 ('Alpha', 2, datetime.date(2018, 7, 2)),
 ('Alpha', 3, datetime.date(2018, 7, 1)),
 ('Bravo', 1, datetime.date(2018, 6, 25)),
 ('Bravo', 2, None),
 ('Bravo', 3, datetime.date(2018, 6, 27)),
 ('Charlie', 1, None),
 ('Charlie', 2, datetime.date(2018, 7, 1))]

In [7]:
%%capture --no-display
%%sql

SELECT workflow, COUNT(stepnumber), COUNT(completiondate)
FROM WorkflowSteps
GROUP BY workflow
HAVING COUNT(stepnumber) != COUNT(completiondate)

[('Charlie', 2, 1), ('Bravo', 3, 2)]

### Puzzle #7

In [8]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Candidates;
DROP TABLE IF EXISTS Requirements;

CREATE TABLE Candidates
(
CandidateID INTEGER,
Occupation  VARCHAR(100),
PRIMARY KEY (CandidateID, Occupation)
);

INSERT INTO Candidates (CandidateID, Occupation) VALUES
(1001,'Geologist'),(1001,'Astrogator'),(1001,'Biochemist'),
(1001,'Technician'),(2002,'Surgeon'),(2002,'Machinist'),
(3003,'Cryologist'),(4004,'Selenologist');

CREATE TABLE Requirements
(
Requirement VARCHAR(100) PRIMARY KEY
);

INSERT INTO Requirements VALUES
('Geologist'),('Astrogator'),('Technician');

[]

In [10]:
%%capture --no-display
%%sql

SELECT *
FROM Candidates

[(1001, 'Geologist'),
 (1001, 'Astrogator'),
 (1001, 'Biochemist'),
 (1001, 'Technician'),
 (2002, 'Surgeon'),
 (2002, 'Machinist'),
 (3003, 'Cryologist'),
 (4004, 'Selenologist')]

In [12]:
%%capture --no-display
%%sql

SELECT CandidateID, COUNT(Occupation)
FROM Candidates
WHERE occupation = 'Geologist' OR occupation = 'Astrogator' OR occupation = 'Technician'
GROUP BY CandidateID
HAVING COUNT(Occupation) = 3

[(1001, 3)]

### Puzzle #8

In [13]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS WorkflowCases;

CREATE TABLE WorkflowCases
(
Workflow  VARCHAR(100) PRIMARY KEY,
Case1     INTEGER NOT NULL DEFAULT 0,
Case2     INTEGER NOT NULL DEFAULT 0,
Case3     INTEGER NOT NULL DEFAULT 0
);

INSERT INTO WorkflowCases (Workflow, Case1, Case2, Case3) VALUES
('Alpha',0,0,0),('Bravo',0,1,1),('Charlie',1,0,0),('Delta',0,0,0);

[]

In [15]:
%%capture --no-display
%%sql

SELECT workflow, (case1 + case2 + case3) AS Sum
FROM WorkflowCases

[('Alpha', 0), ('Bravo', 2), ('Charlie', 1), ('Delta', 0)]

### Puzzle #9

In [16]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees
(
EmployeeID  INTEGER,
License     VARCHAR(100),
PRIMARY KEY (EmployeeID, License)
);

INSERT INTO Employees (EmployeeID, License) VALUES
(1001,'Class A'),(1001,'Class B'),(1001,'Class C'),
(2002,'Class A'),(2002,'Class B'),(2002,'Class C'),
(3003,'Class A'),(3003,'Class D'),
(4004,'Class A'),(4004,'Class B'),(4004,'Class D'),
(5005,'Class A'),(5005,'Class B'),(5005,'Class D');

[]

In [ ]:
%%capture --no-display
%%sql

### Puzzle #10

In [17]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS SampleData;

CREATE TABLE SampleData
(
IntegerValue  INTEGER NOT NULL
);

INSERT INTO SampleData VALUES
(5),(6),(10),(10),(13),(14),(17),(20),(81),(90),(76);

[]

In [22]:
%%capture --no-display
%%sql

SELECT AVG(Cast(IntegerValue as Float))
FROM SampleData

[(31.09090909090909,)]

In [24]:
%%capture --no-display
%%sql

SELECT *
FROM SampleData
WHERE IntegerValue IS Not NULL
GROUP BY IntegerValue
ORDER BY COUNT(*) DESC
LIMIT 1

[(10,)]

In [25]:
%%capture --no-display
%%sql

SELECT PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY IntegerValue) FROM SampleData;

[(14.0,)]

### Puzzle #11

In [4]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS TestCases;

CREATE TABLE TestCases
(
TestCase   VARCHAR(1) PRIMARY KEY
);

INSERT INTO TestCases (TestCase) VALUES
('A'),('B'),('C');

In [ ]:
TO BE DONE

### Puzzle #12

In [26]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS ProcessLog;

CREATE TABLE ProcessLog
(
WorkFlow       VARCHAR(100),
ExecutionDate  DATE,
PRIMARY KEY (WorkFlow, ExecutionDate)
);

INSERT INTO ProcessLog (WorkFlow, ExecutionDate) VALUES
('Alpha','6/01/2018'),('Alpha','6/14/2018'),('Alpha','6/15/2018'),
('Bravo','6/1/2018'),('Bravo','6/2/2018'),('Bravo','6/19/2018'),
('Charlie','6/1/2018'),('Charlie','6/15/2018'),('Charlie','6/30/2018');

[]

In [33]:
%%capture --no-display
%%sql

SELECT *
FROM ProcessLog

[('Alpha', datetime.date(2018, 6, 1)),
 ('Alpha', datetime.date(2018, 6, 14)),
 ('Alpha', datetime.date(2018, 6, 15)),
 ('Bravo', datetime.date(2018, 6, 1)),
 ('Bravo', datetime.date(2018, 6, 2)),
 ('Bravo', datetime.date(2018, 6, 19)),
 ('Charlie', datetime.date(2018, 6, 1)),
 ('Charlie', datetime.date(2018, 6, 15)),
 ('Charlie', datetime.date(2018, 6, 30))]

In [1]:
%%capture --no-display
%%sql

SELECT *, LAG(population_needing_house) OVER (PARTITION BY workflow ORDER BY executiondate) AS previous_year,
FROM ProcessLog

In [ ]:
TO BE DONE

### Puzzle #13

In [20]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS ProcessLog;

CREATE TABLE ProcessLog
(
WorkFlow       VARCHAR(100),
ExecutionDate  DATE,
PRIMARY KEY (WorkFlow, ExecutionDate)
);

INSERT INTO ProcessLog (WorkFlow, ExecutionDate) VALUES
('Alpha','6/01/2018'),('Alpha','6/14/2018'),('Alpha','6/15/2018'),
('Bravo','6/1/2018'),('Bravo','6/2/2018'),('Bravo','6/19/2018'),
('Charlie','6/1/2018'),('Charlie','6/15/2018'),('Charlie','6/30/2018');

In [21]:
%%capture --no-display
%%sql

SELECT *
FROM ProcessLog

### Puzzle #14

In [30]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS ProcessLog;

CREATE TABLE ProcessLog
(
Workflow    VARCHAR(100),
StepNumber  INTEGER,
RunStatus   VARCHAR(100) NOT NULL,
PRIMARY KEY (Workflow, StepNumber)
);

INSERT INTO ProcessLog (Workflow, StepNumber, RunStatus) VALUES
('Alpha',1,'Error'),('Alpha',2,'Complete'),('Alpha',3,'Running'),
('Bravo',1,'Complete'),('Bravo',2,'Complete'),
('Charlie',1,'Running'),('Charlie',2,'Running'),
('Delta',1,'Error'),('Delta',2,'Error'),
('Echo',1,'Running'),('Echo',2,'Complete');

[]

# https://www.postgresql.org/docs/8.4/functions-aggregate.html
https://www.w3schools.com/sql/sql_case.asp
https://josipmisko.com/posts/sql-string-contains-substring

In [32]:
%%capture --no-display
%%sql

SELECT workflow,
--STRING_AGG(runstatus, ' '),
--COUNT(DISTINCT runstatus),
CASE
	WHEN COUNT(DISTINCT runstatus) = 1 THEN MAX(runstatus)
	WHEN STRING_AGG(runstatus, ' ') LIKE '%Error%' THEN 'Indeterminate'
	WHEN STRING_AGG(runstatus, ' ') NOT LIKE '%Error%' THEN 'Running'
END AS Status
FROM ProcessLog
GROUP BY workflow
ORDER BY workflow

[('Alpha', 'Indeterminate'),
 ('Bravo', 'Complete'),
 ('Charlie', 'Running'),
 ('Delta', 'Error'),
 ('Echo', 'Running')]

### Puzzle #15

In [33]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS DMLTable;

CREATE TABLE DMLTable
(
SequenceNumber  INTEGER PRIMARY KEY,
String          VARCHAR(100) NOT NULL
);

INSERT INTO DMLTable (SequenceNumber, String) VALUES
(1,'SELECT'),
(2,'Product,'),
(3,'UnitPrice,'),
(4,'EffectiveDate'),
(5,'FROM'),
(6,'Products'),
(7,'WHERE'),
(8,'UnitPrice'),
(9,'> 100');

[]

In [34]:
%%capture --no-display
%%sql

SELECT STRING_AGG(string, ' ') FROM DMLTable

[('SELECT Product, UnitPrice, EffectiveDate FROM Products WHERE UnitPrice > 100',)]

### Puzzle #16

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #17

In [35]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS Ungroup;

CREATE TABLE Ungroup
(
ProductDescription  VARCHAR(100) PRIMARY KEY,
Quantity            INTEGER NOT NULL
);

INSERT INTO Ungroup (ProductDescription, Quantity) VALUES
('Pencil',3),('Eraser',4),('Notebook',2);

[]

In [ ]:
%%capture --no-display
%%sql

### Puzzle #18

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #19

In [ ]:
%%capture --no-display
%%sql

In [ ]:
%%capture --no-display
%%sql

### Puzzle #20

In [38]:
%%capture --no-display
%%sql

DROP TABLE IF EXISTS ValidPrices;

CREATE TABLE ValidPrices
(
ProductID      INTEGER,
UnitPrice      MONEY,
EffectiveDate  DATE,
PRIMARY KEY (ProductID, UnitPrice, EffectiveDate)
);

INSERT INTO ValidPrices (ProductID, UnitPrice, EffectiveDate) VALUES
(1001,1.99,'1/01/2018'),
(1001,2.99,'4/15/2018'),
(1001,3.99,'6/8/2018'),
(2002,1.99,'4/17/2018'),
(2002,2.99,'5/19/2018');

[]

In [39]:
%%capture --no-display
%%sql

SELECT *
FROM ValidPrices
WHERE (productid, EffectiveDate) IN 
( SELECT productid, MAX(EffectiveDate)
  FROM ValidPrices
  GROUP BY productid
)

[(1001, '$3.99', datetime.date(2018, 6, 8)),
 (2002, '$2.99', datetime.date(2018, 5, 19))]